espressif/esp-idf/components/soc/esp32h4/register/soc/rmt_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** RMT_CH0DATA_REG register
 *  The read and write data register for channel 0 by APB FIFO access.
 */
#define RMT_CH0DATA_REG (DR_REG_RMT_BASE + 0x0)
/** RMT_CH0DATA : HRO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 0 via APB FIFO.
 */
#define RMT_CH0DATA    0xFFFFFFFFU
#define RMT_CH0DATA_M  (RMT_CH0DATA_V << RMT_CH0DATA_S)
#define RMT_CH0DATA_V  0xFFFFFFFFU
#define RMT_CH0DATA_S  0

/** RMT_CH1DATA_REG register
 *  The read and write data register for channel 1 by APB FIFO access.
 */
#define RMT_CH1DATA_REG (DR_REG_RMT_BASE + 0x4)
/** RMT_CH1DATA : HRO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 1 via APB FIFO.
 */
#define RMT_CH1DATA    0xFFFFFFFFU
#define RMT_CH1DATA_M  (RMT_CH1DATA_V << RMT_CH1DATA_S)
#define RMT_CH1DATA_V  0xFFFFFFFFU
#define RMT_CH1DATA_S  0

/** RMT_CH2DATA_REG register
 *  The read and write data register for channel 2 by APB FIFO access.
 */
#define RMT_CH2DATA_REG (DR_REG_RMT_BASE + 0x8)
/** RMT_CH2DATA : HRO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 2 via APB FIFO.
 */
#define RMT_CH2DATA    0xFFFFFFFFU
#define RMT_CH2DATA_M  (RMT_CH2DATA_V << RMT_CH2DATA_S)
#define RMT_CH2DATA_V  0xFFFFFFFFU
#define RMT_CH2DATA_S  0

/** RMT_CH3DATA_REG register
 *  The read and write data register for channel 3 by APB FIFO access.
 */
#define RMT_CH3DATA_REG (DR_REG_RMT_BASE + 0xc)
/** RMT_CH3DATA : HRO; bitpos: [31:0]; default: 0;
 *  Read and write data for channel 3 via APB FIFO.
 */
#define RMT_CH3DATA    0xFFFFFFFFU
#define RMT_CH3DATA_M  (RMT_CH3DATA_V << RMT_CH3DATA_S)
#define RMT_CH3DATA_V  0xFFFFFFFFU
#define RMT_CH3DATA_S  0

/** RMT_CH0CONF0_REG register
 *  Configuration register 0 for channel 0
 */
#define RMT_CH0CONF0_REG (DR_REG_RMT_BASE + 0x10)
/** RMT_TX_START_CH0 : WT; bitpos: [0]; default: 0;
 *  Configures whether to enable sending data in channel 0.
 *  0: No effect
 *  1: Enable
 */
#define RMT_TX_START_CH0    (BIT(0))
#define RMT_TX_START_CH0_M  (RMT_TX_START_CH0_V << RMT_TX_START_CH0_S)
#define RMT_TX_START_CH0_V  0x00000001U
#define RMT_TX_START_CH0_S  0
/** RMT_MEM_RD_RST_CH0 : WT; bitpos: [1]; default: 0;
 *  Configures whether to reset RAM read address accessed by the transmitter for
 *  channel 0.
 *  0: No effect
 *  1: Reset
 */
#define RMT_MEM_RD_RST_CH0    (BIT(1))
#define RMT_MEM_RD_RST_CH0_M  (RMT_MEM_RD_RST_CH0_V << RMT_MEM_RD_RST_CH0_S)
#define RMT_MEM_RD_RST_CH0_V  0x00000001U
#define RMT_MEM_RD_RST_CH0_S  1
/** RMT_APB_MEM_RST_CH0 : WT; bitpos: [2]; default: 0;
 *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel 0.
 *  0: No effect
 *  1: Reset
 */
#define RMT_APB_MEM_RST_CH0    (BIT(2))
#define RMT_APB_MEM_RST_CH0_M  (RMT_APB_MEM_RST_CH0_V << RMT_APB_MEM_RST_CH0_S)
#define RMT_APB_MEM_RST_CH0_V  0x00000001U
#define RMT_APB_MEM_RST_CH0_S  2
/** RMT_TX_CONTI_MODE_CH0 : R/W; bitpos: [3]; default: 0;
 *  Configures whether to enable continuous TX mode for channel 0.
 *  0: No Effect
 *  1: Enable
 *  In this mode, the transmitter starts transmission from the first data. If an
 *  end-marker is encountered, the transmitter starts transmitting data from the first
 *  data again. if no end-marker is encountered, the transmitter starts transmitting
 *  the first data again when the last data is transmitted.
 */
#define RMT_TX_CONTI_MODE_CH0    (BIT(3))
#define RMT_TX_CONTI_MODE_CH0_M  (RMT_TX_CONTI_MODE_CH0_V << RMT_TX_CONTI_MODE_CH0_S)
#define RMT_TX_CONTI_MODE_CH0_V  0x00000001U
#define RMT_TX_CONTI_MODE_CH0_S  3
/** RMT_MEM_TX_WRAP_EN_CH0 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable wrap TX mode for channel 0.
 *  0: No effect
 *  1: Enable
 *  In this mode, if the TX data size is larger than the channel's RAM block size, the
 *  transmitter continues transmitting the first data to the last data in loops.
 */
#define RMT_MEM_TX_WRAP_EN_CH0    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_CH0_M  (RMT_MEM_TX_WRAP_EN_CH0_V << RMT_MEM_TX_WRAP_EN_CH0_S)
#define RMT_MEM_TX_WRAP_EN_CH0_V  0x00000001U
#define RMT_MEM_TX_WRAP_EN_CH0_S  4
/** RMT_IDLE_OUT_LV_CH0 : R/W; bitpos: [5]; default: 0;
 *  Configures the level of output signal for channel 0 when the transmitter is in idle
 *  state.
 */
#define RMT_IDLE_OUT_LV_CH0    (BIT(5))
#define RMT_IDLE_OUT_LV_CH0_M  (RMT_IDLE_OUT_LV_CH0_V << RMT_IDLE_OUT_LV_CH0_S)
#define RMT_IDLE_OUT_LV_CH0_V  0x00000001U
#define RMT_IDLE_OUT_LV_CH0_S  5
/** RMT_IDLE_OUT_EN_CH0 : R/W; bitpos: [6]; default: 0;
 *  Configures whether to enable the output for channel 0 in idle state.
 *  0: No effect
 *  1: Enable
 */
#define RMT_IDLE_OUT_EN_CH0    (BIT(6))
#define RMT_IDLE_OUT_EN_CH0_M  (RMT_IDLE_OUT_EN_CH0_V << RMT_IDLE_OUT_EN_CH0_S)
#define RMT_IDLE_OUT_EN_CH0_V  0x00000001U
#define RMT_IDLE_OUT_EN_CH0_S  6
/** RMT_TX_STOP_CH0 : R/W/SC; bitpos: [7]; default: 0;
 *  Configures whether to stop the transmitter of channel 0 sending data out.
 *  0: No effect
 *  1: Stop
 */
#define RMT_TX_STOP_CH0    (BIT(7))
#define RMT_TX_STOP_CH0_M  (RMT_TX_STOP_CH0_V << RMT_TX_STOP_CH0_S)
#define RMT_TX_STOP_CH0_V  0x00000001U
#define RMT_TX_STOP_CH0_S  7
/** RMT_DIV_CNT_CH0 : R/W; bitpos: [15:8]; default: 2;
 *  Configures the divider for clock of channel 0.
 *  Measurement unit: rmt_sclk
 */
#define RMT_DIV_CNT_CH0    0x000000FFU
#define RMT_DIV_CNT_CH0_M  (RMT_DIV_CNT_CH0_V << RMT_DIV_CNT_CH0_S)
#define RMT_DIV_CNT_CH0_V  0x000000FFU
#define RMT_DIV_CNT_CH0_S  8
/** RMT_MEM_SIZE_CH0 : R/W; bitpos: [18:16]; default: 1;
 *  Configures the maximum number of memory blocks allocated to channel 0.
 */
#define RMT_MEM_SIZE_CH0    0x00000007U
#define RMT_MEM_SIZE_CH0_M  (RMT_MEM_SIZE_CH0_V << RMT_MEM_SIZE_CH0_S)
#define RMT_MEM_SIZE_CH0_V  0x00000007U
#define RMT_MEM_SIZE_CH0_S  16
/** RMT_CARRIER_EFF_EN_CH0 : R/W; bitpos: [20]; default: 1;
 *  Configures whether to add carrier modulation on the output signal only at
 *  data-sending state for channel 0.
 *  0: Add carrier modulation on the output signal at data-sending state and idle state
 *  for channel 0
 *  1: Add carrier modulation on the output signal only at data-sending state for
 *  channel 0
 *  Only valid when RMT_CARRIER_EN_CH0 is 1.
 */
#define RMT_CARRIER_EFF_EN_CH0    (BIT(20))
#define RMT_CARRIER_EFF_EN_CH0_M  (RMT_CARRIER_EFF_EN_CH0_V << RMT_CARRIER_EFF_EN_CH0_S)
#define RMT_CARRIER_EFF_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EFF_EN_CH0_S  20
/** RMT_CARRIER_EN_CH0 : R/W; bitpos: [21]; default: 1;
 *  Configures whether to enable the carrier modulation on output signal for channel 0.
 *  0: Disable
 *  1: Enable
 */
#define RMT_CARRIER_EN_CH0    (BIT(21))
#define RMT_CARRIER_EN_CH0_M  (RMT_CARRIER_EN_CH0_V << RMT_CARRIER_EN_CH0_S)
#define RMT_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EN_CH0_S  21
/** RMT_CARRIER_OUT_LV_CH0 : R/W; bitpos: [22]; default: 1;
 *  Configures the position of carrier wave for channel 0.
 *  0: Add carrier wave on low level
 *  1: Add carrier wave on high level
 */
#define RMT_CARRIER_OUT_LV_CH0    (BIT(22))
#define RMT_CARRIER_OUT_LV_CH0_M  (RMT_CARRIER_OUT_LV_CH0_V << RMT_CARRIER_OUT_LV_CH0_S)
#define RMT_CARRIER_OUT_LV_CH0_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH0_S  22
/** RMT_CONF_UPDATE_CH0 : WT; bitpos: [24]; default: 0;
 *  Synchronization bit for channel 0.
 */
#define RMT_CONF_UPDATE_CH0    (BIT(24))
#define RMT_CONF_UPDATE_CH0_M  (RMT_CONF_UPDATE_CH0_V << RMT_CONF_UPDATE_CH0_S)
#define RMT_CONF_UPDATE_CH0_V  0x00000001U
#define RMT_CONF_UPDATE_CH0_S  24

/** RMT_CH1CONF0_REG register
 *  Configuration register 0 for channel 1
 */
#define RMT_CH1CONF0_REG (DR_REG_RMT_BASE + 0x14)
/** RMT_TX_START_CH1 : WT; bitpos: [0]; default: 0;
 *  Configures whether to enable sending data in channel 1.
 *  0: No effect
 *  1: Enable
 */
#define RMT_TX_START_CH1    (BIT(0))
#define RMT_TX_START_CH1_M  (RMT_TX_START_CH1_V << RMT_TX_START_CH1_S)
#define RMT_TX_START_CH1_V  0x00000001U
#define RMT_TX_START_CH1_S  0
/** RMT_MEM_RD_RST_CH1 : WT; bitpos: [1]; default: 0;
 *  Configures whether to reset RAM read address accessed by the transmitter for
 *  channel 1.
 *  0: No effect
 *  1: Reset
 */
#define RMT_MEM_RD_RST_CH1    (BIT(1))
#define RMT_MEM_RD_RST_CH1_M  (RMT_MEM_RD_RST_CH1_V << RMT_MEM_RD_RST_CH1_S)
#define RMT_MEM_RD_RST_CH1_V  0x00000001U
#define RMT_MEM_RD_RST_CH1_S  1
/** RMT_APB_MEM_RST_CH1 : WT; bitpos: [2]; default: 0;
 *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel 1.
 *  0: No effect
 *  1: Reset
 */
#define RMT_APB_MEM_RST_CH1    (BIT(2))
#define RMT_APB_MEM_RST_CH1_M  (RMT_APB_MEM_RST_CH1_V << RMT_APB_MEM_RST_CH1_S)
#define RMT_APB_MEM_RST_CH1_V  0x00000001U
#define RMT_APB_MEM_RST_CH1_S  2
/** RMT_TX_CONTI_MODE_CH1 : R/W; bitpos: [3]; default: 0;
 *  Configures whether to enable continuous TX mode for channel 1.
 *  0: No Effect
 *  1: Enable
 *  In this mode, the transmitter starts transmission from the first data. If an
 *  end-marker is encountered, the transmitter starts transmitting data from the first
 *  data again. if no end-marker is encountered, the transmitter starts transmitting
 *  the first data again when the last data is transmitted.
 */
#define RMT_TX_CONTI_MODE_CH1    (BIT(3))
#define RMT_TX_CONTI_MODE_CH1_M  (RMT_TX_CONTI_MODE_CH1_V << RMT_TX_CONTI_MODE_CH1_S)
#define RMT_TX_CONTI_MODE_CH1_V  0x00000001U
#define RMT_TX_CONTI_MODE_CH1_S  3
/** RMT_MEM_TX_WRAP_EN_CH1 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable wrap TX mode for channel 1.
 *  0: No effect
 *  1: Enable
 *  In this mode, if the TX data size is larger than the channel's RAM block size, the
 *  transmitter continues transmitting the first data to the last data in loops.
 */
#define RMT_MEM_TX_WRAP_EN_CH1    (BIT(4))
#define RMT_MEM_TX_WRAP_EN_CH1_M  (RMT_MEM_TX_WRAP_EN_CH1_V << RMT_MEM_TX_WRAP_EN_CH1_S)
#define RMT_MEM_TX_WRAP_EN_CH1_V  0x00000001U
#define RMT_MEM_TX_WRAP_EN_CH1_S  4
/** RMT_IDLE_OUT_LV_CH1 : R/W; bitpos: [5]; default: 0;
 *  Configures the level of output signal for channel 1 when the transmitter is in idle
 *  state.
 */
#define RMT_IDLE_OUT_LV_CH1    (BIT(5))
#define RMT_IDLE_OUT_LV_CH1_M  (RMT_IDLE_OUT_LV_CH1_V << RMT_IDLE_OUT_LV_CH1_S)
#define RMT_IDLE_OUT_LV_CH1_V  0x00000001U
#define RMT_IDLE_OUT_LV_CH1_S  5
/** RMT_IDLE_OUT_EN_CH1 : R/W; bitpos: [6]; default: 0;
 *  Configures whether to enable the output for channel 1 in idle state.
 *  0: No effect
 *  1: Enable
 */
#define RMT_IDLE_OUT_EN_CH1    (BIT(6))
#define RMT_IDLE_OUT_EN_CH1_M  (RMT_IDLE_OUT_EN_CH1_V << RMT_IDLE_OUT_EN_CH1_S)
#define RMT_IDLE_OUT_EN_CH1_V  0x00000001U
#define RMT_IDLE_OUT_EN_CH1_S  6
/** RMT_TX_STOP_CH1 : R/W/SC; bitpos: [7]; default: 0;
 *  Configures whether to stop the transmitter of channel 1 sending data out.
 *  0: No effect
 *  1: Stop
 */
#define RMT_TX_STOP_CH1    (BIT(7))
#define RMT_TX_STOP_CH1_M  (RMT_TX_STOP_CH1_V << RMT_TX_STOP_CH1_S)
#define RMT_TX_STOP_CH1_V  0x00000001U
#define RMT_TX_STOP_CH1_S  7
/** RMT_DIV_CNT_CH1 : R/W; bitpos: [15:8]; default: 2;
 *  Configures the divider for clock of channel 1.
 *  Measurement unit: rmt_sclk
 */
#define RMT_DIV_CNT_CH1    0x000000FFU
#define RMT_DIV_CNT_CH1_M  (RMT_DIV_CNT_CH1_V << RMT_DIV_CNT_CH1_S)
#define RMT_DIV_CNT_CH1_V  0x000000FFU
#define RMT_DIV_CNT_CH1_S  8
/** RMT_MEM_SIZE_CH1 : R/W; bitpos: [18:16]; default: 1;
 *  Configures the maximum number of memory blocks allocated to channel 1.
 */
#define RMT_MEM_SIZE_CH1    0x00000007U
#define RMT_MEM_SIZE_CH1_M  (RMT_MEM_SIZE_CH1_V << RMT_MEM_SIZE_CH1_S)
#define RMT_MEM_SIZE_CH1_V  0x00000007U
#define RMT_MEM_SIZE_CH1_S  16
/** RMT_CARRIER_EFF_EN_CH1 : R/W; bitpos: [20]; default: 1;
 *  Configures whether to add carrier modulation on the output signal only at
 *  data-sending state for channel 1.
 *  0: Add carrier modulation on the output signal at data-sending state and idle state
 *  for channel 1
 *  1: Add carrier modulation on the output signal only at data-sending state for
 *  channel 1
 *  Only valid when RMT_CARRIER_EN_CH1 is 1.
 */
#define RMT_CARRIER_EFF_EN_CH1    (BIT(20))
#define RMT_CARRIER_EFF_EN_CH1_M  (RMT_CARRIER_EFF_EN_CH1_V << RMT_CARRIER_EFF_EN_CH1_S)
#define RMT_CARRIER_EFF_EN_CH1_V  0x00000001U
#define RMT_CARRIER_EFF_EN_CH1_S  20
/** RMT_CARRIER_EN_CH1 : R/W; bitpos: [21]; default: 1;
 *  Configures whether to enable the carrier modulation on output signal for channel 1.
 *  0: Disable
 *  1: Enable
 */
#define RMT_CARRIER_EN_CH1    (BIT(21))
#define RMT_CARRIER_EN_CH1_M  (RMT_CARRIER_EN_CH1_V << RMT_CARRIER_EN_CH1_S)
#define RMT_CARRIER_EN_CH1_V  0x00000001U
#define RMT_CARRIER_EN_CH1_S  21
/** RMT_CARRIER_OUT_LV_CH1 : R/W; bitpos: [22]; default: 1;
 *  Configures the position of carrier wave for channel 1.
 *  0: Add carrier wave on low level
 *  1: Add carrier wave on high level
 */
#define RMT_CARRIER_OUT_LV_CH1    (BIT(22))
#define RMT_CARRIER_OUT_LV_CH1_M  (RMT_CARRIER_OUT_LV_CH1_V << RMT_CARRIER_OUT_LV_CH1_S)
#define RMT_CARRIER_OUT_LV_CH1_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH1_S  22
/** RMT_CONF_UPDATE_CH1 : WT; bitpos: [24]; default: 0;
 *  Synchronization bit for channel 1.
 */
#define RMT_CONF_UPDATE_CH1    (BIT(24))
#define RMT_CONF_UPDATE_CH1_M  (RMT_CONF_UPDATE_CH1_V << RMT_CONF_UPDATE_CH1_S)
#define RMT_CONF_UPDATE_CH1_V  0x00000001U
#define RMT_CONF_UPDATE_CH1_S  24

/** RMT_CH2CONF0_REG register
 *  Configuration register 0 for channel 2
 */
#define RMT_CH2CONF0_REG (DR_REG_RMT_BASE + 0x18)
/** RMT_DIV_CNT_CH2 : R/W; bitpos: [7:0]; default: 2;
 *  Configures the clock divider of channel 2.
 *  Measurement unit: rmt_sclk
 */
#define RMT_DIV_CNT_CH2    0x000000FFU
#define RMT_DIV_CNT_CH2_M  (RMT_DIV_CNT_CH2_V << RMT_DIV_CNT_CH2_S)
#define RMT_DIV_CNT_CH2_V  0x000000FFU
#define RMT_DIV_CNT_CH2_S  0
/** RMT_IDLE_THRES_CH2 : R/W; bitpos: [22:8]; default: 32767;
 *  Configures RX threshold.
 *  When no edge is detected on the input signal for continuous clock cycles longer
 *  than this field value, the receiver stops receiving data.
 *  Measurement unit: clk_div
 */
#define RMT_IDLE_THRES_CH2    0x00007FFFU
#define RMT_IDLE_THRES_CH2_M  (RMT_IDLE_THRES_CH2_V << RMT_IDLE_THRES_CH2_S)
#define RMT_IDLE_THRES_CH2_V  0x00007FFFU
#define RMT_IDLE_THRES_CH2_S  8
/** RMT_MEM_SIZE_CH2 : R/W; bitpos: [25:23]; default: 1;
 *  Configures the maximum number of memory blocks allocated to channel 2.
 */
#define RMT_MEM_SIZE_CH2    0x00000007U
#define RMT_MEM_SIZE_CH2_M  (RMT_MEM_SIZE_CH2_V << RMT_MEM_SIZE_CH2_S)
#define RMT_MEM_SIZE_CH2_V  0x00000007U
#define RMT_MEM_SIZE_CH2_S  23
/** RMT_CARRIER_EN_CH2 : R/W; bitpos: [28]; default: 1;
 *  Configures whether to enable carrier modulation on output signal for channel 2.
 *  0: Disable
 *  1: Enable
 */
#define RMT_CARRIER_EN_CH2    (BIT(28))
#define RMT_CARRIER_EN_CH2_M  (RMT_CARRIER_EN_CH2_V << RMT_CARRIER_EN_CH2_S)
#define RMT_CARRIER_EN_CH2_V  0x00000001U
#define RMT_CARRIER_EN_CH2_S  28
/** RMT_CARRIER_OUT_LV_CH2 : R/W; bitpos: [29]; default: 1;
 *  Configures the position of carrier wave for channel 2.
 *  0: Add carrier wave on low level
 *  1: Add carrier wave on high level
 */
#define RMT_CARRIER_OUT_LV_CH2    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH2_M  (RMT_CARRIER_OUT_LV_CH2_V << RMT_CARRIER_OUT_LV_CH2_S)
#define RMT_CARRIER_OUT_LV_CH2_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH2_S  29

